### 열 순서 변경 
- df의 열 순서 변경 : DataFrame 객체[재구성한 열 이름의 리스트]

In [5]:
import seaborn as sns 

titanic = sns.load_dataset('titanic')
df = titanic.loc[0:4, 'survived' : 'age']
print(df)

   survived  pclass     sex   age
0         0       3    male  22.0
1         1       1  female  38.0
2         1       3  female  26.0
3         1       1  female  35.0
4         0       3    male  35.0

- df의 열 이름 배열을 나타내는 df.columns.values 속성을 선택하여 파이썬 list() 함수에 전달 
- df 열이 원래 순서를 유지한 상태에서 리스트로 변환

In [6]:
columns = list(df.columns.values)
columns

['survived', 'pclass', 'sex', 'age']

- sorted() 함수에 columns 변수를 입력하면 열 이름이 알파벳 순으로 정렬

In [7]:
columns_sorted = sorted(columns)
df_sorted = df[columns_sorted] 
df_sorted

    age  pclass     sex  survived
0  22.0       3    male         0
1  38.0       1  female         1
2  26.0       3  female         1
3  35.0       1  female         1
4  35.0       3    male         0

- reversed() 함수에 columns 변수를 전달하면 역순으로 정렬

In [8]:
columns_reversed = list(reversed(columns))
df_reversed = df[columns_reversed]
df_reversed

    age     sex  pclass  survived
0  22.0    male       3         0
1  38.0  female       1         1
2  26.0  female       3         1
3  35.0  female       1         1
4  35.0    male       3         0

In [9]:
columns_customed = ['pclass', 'sex', 'age', 'survived']
df_customed = df[columns_customed]
df_customed

   pclass     sex   age  survived
0       3    male  22.0         0
1       1  female  38.0         1
2       3  female  26.0         1
3       1  female  35.0         1
4       3    male  35.0         0